
import numpy as np
import matplotlib.pyplot as plt
#Задача 1


zp = np.array([35, 45, 190, 200, 40, 70, 54, 150, 120, 110])
ks = np.array([401, 574, 874, 919, 459, 739, 653, 902, 746, 832])

plt.scatter(zp, ks)
plt.xlabel('Заработая плата заемщиков')
plt.ylabel('Поведенческий кредитный скоринг', rotation = 90)
plt.show()
#Исходя из полученного графика, делаем предположение о наличии некоей линейной взаимосвязи.

b = (np.mean(zp * ks) - np.mean(zp) * np.mean(ks)) / (np.mean(zp ** 2) - np.mean(zp) ** 2)
#b=2.620538882402765
a = np.mean(ks) - b * np.mean(zp)
#a=444.1773573243596
plt.scatter(zp, ks)
plt.plot(zp, a + b * zp, c = 'r')
plt.xlabel('Заработая плата заемщиков')
plt.ylabel('Поведенческий кредитный скоринг', rotation = 90)
plt.show()

#Произведенный расчет наглядно показывает линейную взаимосвязь между величиной заработной платы и значением кредитного скоринга.
#Задача 2


def mse(b, x, y):
    return np.sum((b * x - y) ** 2) / len(x)
mse(b, zp, ks)
203763.93896082853
#Вычислим производную нашей функции потерь:

def mse_p(b,x,y):
    return (2 / len(x)) * np.sum((b * x - y) * x)
alpha = 1e-6
b = 0.1
mse_min = mse(b, zp, ks)
i_min = 1
b_min = b
iteration = 10000
for i in range(iteration):
    b -= alpha * mse_p(b, zp, ks)
    if i % 100 == 0:
        print(f'>>> Итерация #{i}, b={b}, mse={mse(b, zp, ks)}')
    if mse(b, zp, ks) > mse_min:
        print(f'>>> Итерация #{i_min}, b={b_min}, mse={mse_min},\n>>> Достигнут минимум\n>>> Получили {b_min} ')
        break
    else:
        mse_min = mse(b,zp,ks)
        i_min = i
        b_min = b
# >>> Итерация #0, b=0.25952808000000005, mse=493237.7212546963
# >>> Итерация #100, b=5.54537842245223, mse=58151.31823171113
# >>> Итерация #200, b=5.868748638669329, mse=56522.97550129376
# >>> Итерация #300, b=5.888531320728348, mse=56516.88130936019
# >>> Итерация #400, b=5.8897415574471985, mse=56516.85850140053
# >>> Итерация #500, b=5.889815595583751, mse=56516.858416040064
# >>> Итерация #600, b=5.889820124983314, mse=56516.85841572062
# >>> Итерация #628, b=5.889820285147628, mse=56516.85841571966,
# >>> Достигнут минимум
# >>> Получили 5.889820285147628 
